spec/fixtures/vcr_cassettes/Remitano_Client_merchant_charges/_list/page_and_per_page_specified/returns_merchant_charges_in_specified_page.yml

---
http_interactions:
- request:
    method: get
    uri: REMITANO_SERVER/api/v1/merchant/merchant_charges?page=2&per_page=3&status=completed&usec=0
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*"
      User-Agent:
      - rest-client/2.1.0 (darwin18.6.0 x86_64) ruby/2.4.3p205
      Content-Type:
      - application/json
      Date:
      - Tue, 08 Jun 2021 06:49:26 GMT
      Authorization:
      - APIAuth REMITANO_KEY:X0TGKy7wn9lH4IHnejfBm0xrr7k=
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Host:
      - localhost:3100
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/json
      Etag:
      - W/"e9484324073706b8fdd781700b7935ff"
      Cache-Control:
      - max-age=0, private, must-revalidate
      X-Request-Id:
      - 6931336d-5464-4ffa-8ca5-1cd30c905f19
      X-Runtime:
      - '0.122597'
      Vary:
      - Origin
      Content-Length:
      - '1078'
    body:
      encoding: UTF-8
      string: '{"merchant_charges":[{"id":18,"coin_currency":"usdt","coin_amount":100.0,"status":"completed","ref":"MDR8901116264","description":null,"cancelled_or_completed_callback_url":null,"remitano_payment_url":"http://localhost:3200/payment_gateway/pay/MDR8901116264","created_at_timestamp":1620092660,"expired_at_timestamp":0,"payer_name":"buyer"},{"id":17,"coin_currency":"usdt","coin_amount":100.0,"status":"completed","ref":"MDR9240267766","description":null,"cancelled_or_completed_callback_url":null,"remitano_payment_url":"http://localhost:3200/payment_gateway/pay/MDR9240267766","created_at_timestamp":1620092056,"expired_at_timestamp":0,"payer_name":"sugaro"},{"id":16,"coin_currency":"usdt","coin_amount":10.0,"status":"completed","ref":"MDR7154137395","description":null,"cancelled_or_completed_callback_url":null,"remitano_payment_url":"http://localhost:3200/payment_gateway/pay/MDR7154137395","created_at_timestamp":1620091757,"expired_at_timestamp":0,"payer_name":"buyer"}],"meta":{"per_page":3,"current_page":2,"next_page":3,"prev_page":1,"total_pages":3,"total_items":8}}'
    http_version:
  recorded_at: Tue, 08 Jun 2021 06:49:26 GMT
recorded_with: VCR 4.0.0
